{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "mask_value": -1, "trainable": true, "batch_input_shape": [null, 5, 25], "dtype": "float32"}}, {"class_name": "LSTM", "config": {"units": 32, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "return_state": false, "recurrent_dropout": 0.0, "unroll": false, "bias_regularizer": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_1", "trainable": true, "implementation": 0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "use_bias": true, "dropout": 0.2, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 13, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "batch_input_shape": [null, 32], "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.8", "backend": "tensorflow"}