{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "mask_value": -1, "trainable": true, "name": "masking_1", "batch_input_shape": [null, 5, 24]}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "go_backwards": false, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_state": false, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 32, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "dropout": 0.2, "recurrent_dropout": 0.0, "stateful": false, "implementation": 0, "recurrent_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "units": 13, "name": "dense_1", "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 32], "activation": "linear", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "backend": "tensorflow"}