{"config": [{"config": {"trainable": true, "mask_value": -1, "batch_input_shape": [null, 2, 11], "name": "masking_1", "dtype": "float32"}, "class_name": "Masking"}, {"config": {"return_sequences": false, "trainable": true, "units": 32, "unit_forget_bias": true, "go_backwards": false, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "activation": "tanh", "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "stateful": false, "kernel_constraint": null, "batch_input_shape": [null, 2, 11], "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "dtype": "float32", "return_state": false, "bias_constraint": null, "activity_regularizer": null, "dropout": 0.2, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "batch_input_shape": [null, 32], "units": 6, "dtype": "float32", "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}